Core/src/Documents/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеРасходы</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПрочимиКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПрочихДоходовИРасходов</name>
    <type>
      <types>Characteristic.АналитикаДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПрочихРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаПрочихДоходовИРасходов</name>
      <type>
        <types>Characteristic.АналитикаДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПрочиеРасходы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт; //+++ Дмгг
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Расходы.Итог("Сумма");
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаРасходы из Расходы Цикл
			
			//+++ Дмгг
			Если (СтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов) //+++ Дмгг
				ИЛИ (СтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы И ИспользоватьТолькоРегламентированногоПланаСчетов) Тогда
				
				СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения,, "АналитикаПрочихДоходовИРасходов");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПрочиеРасходы.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	// Прочие расчеты
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПрочимиКонтрагентами(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата); //+++ Дмгг
	
	Если УчетПрочихРасчетов Тогда
		
		//+++ Дмгг
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
			Если КорреспонденцияРегл.ТипСчета <> Перечисления.ТипыСчетов.Дебиторы 
				И КорреспонденцияРегл.ТипСчета <> Перечисления.ТипыСчетов.Кредиторы Тогда
				
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");	
				
			КонецЕсли;
		Иначе
			Если Корреспонденция.ТипСчета <> Перечисления.ТипыСчетов.Дебиторы 
				И Корреспонденция.ТипСчета <> Перечисления.ТипыСчетов.Кредиторы Тогда
				
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
				УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");	
				
			КонецЕсли;
		КонецЕсли;
		//--- Дмгг
		
		Для Каждого ТекущаяСтрокаРасходы Из Расходы Цикл
			//+++ Дмгг
			//Если ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
			//	ИЛИ ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Кредиторы Тогда
			Если ((ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
				ИЛИ ТекущаяСтрокаРасходы.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Кредиторы) И НЕ ИспользоватьТолькоРегламентированногоПланаСчетов)
				ИЛИ 
				((ТекущаяСтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Дебиторы 
				ИЛИ ТекущаяСтрокаРасходы.СчетЗатратРегл.ТипСчета = Перечисления.ТипыСчетов.Кредиторы) И ИспользоватьТолькоРегламентированногоПланаСчетов) Тогда

				
				Если ТекущаяСтрокаРасходы.Контрагент.Пустая() Тогда
					ТекстСообщения = НСтр("ka='სია ""ხარჯები""-ს სტრიქონ %НомерСтроки%-ში მიუთითეთ კონტრაგენტი.';ru='Укажите контрагента в строке %НомерСтроки% списка ""Расходы"".';en='Specify the counterparty on line% NomerStroki% list ""Expenses"".'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", ТекущаяСтрокаРасходы.НомерСтроки);
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Расходы",
						ТекущаяСтрокаРасходы.НомерСтроки,
						"Контрагент",
						Отказ
					);
				ИначеЕсли ТекущаяСтрокаРасходы.Контрагент.ВестиРасчетыПоДоговорам И ТекущаяСтрокаРасходы.Договор.Пустая() Тогда
					ТекстСообщения = НСтр("ka='სია ""ხარჯები""-ს სტრიქონ %НомерСтроки%-ში მიუთითეთ ხელშეკრულება.';ru='Укажите договор в строке %НомерСтроки% списка ""Расходы"".';en='Specify in the contract line% NomerStroki% list ""Expenses"".'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", ТекущаяСтрокаРасходы.НомерСтроки);
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Расходы",
						ТекущаяСтрокаРасходы.НомерСтроки,
						"Договор",
						Отказ
					);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
	КонецЕсли;
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.СчетЗатрат");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли
